In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_excel(r'Raw.xlsx',usecols = 'A:C')
df = df.iloc[:10]
df

  Name  Num  Item
0   苹果  1.0    40
1   苹果  0.0  good
2   苹果  0.0     8
3   西瓜  1.0    89
4   西瓜  0.0    64
5   西瓜  1.0   bad
6  西红柿  1.0    63
7  火龙果  1.0    13
8  火龙果  0.0   NaN
9  火龙果  0.0     7

In [3]:
df.dtypes

Name     object
Num     float64
Item     object
dtype: object

In [5]:
Item2 = df.groupby('Name').Item\
          .transform(lambda x: ','.join(str(i) for i in x if i != 'NaN'))
Item2

0    40,good,8
1    40,good,8
2    40,good,8
3    89,64,bad
4    89,64,bad
5    89,64,bad
6           63
7     13,nan,7
8     13,nan,7
9     13,nan,7
Name: Item, dtype: object

In [6]:
(
    df.assign(Num2=np.where(df.Num == 1, df.Name, ''))
    .assign(Item2=Item2)
)

  Name  Num  Item Num2      Item2
0   苹果  1.0    40   苹果  40,good,8
1   苹果  0.0  good       40,good,8
2   苹果  0.0     8       40,good,8
3   西瓜  1.0    89   西瓜  89,64,bad
4   西瓜  0.0    64       89,64,bad
5   西瓜  1.0   bad   西瓜  89,64,bad
6  西红柿  1.0    63  西红柿         63
7  火龙果  1.0    13  火龙果   13,nan,7
8  火龙果  0.0   NaN        13,nan,7
9  火龙果  0.0     7        13,nan,7